app/Controllers/Home.php

    public function listar()
    {
        $produto_model = new ProdutoModel();
        $produtos = $produto_model
                            ->findAll();
---
SELECT *
FROM `produtos`

    public function cadastrar()
    {
        $dados = $this->request
                        ->getVar();
        $produto_model = new ProdutoModel();
        $produto_model->insert($dados);
---
INSERT INTO `produtos` (`Nome`, `Qtde`, `Valor`) VALUES ('NOTEBOOK DELL 16GB', '12', '10000')